WiseMCU/AT32F435/drivers/f435_437/drv_common.h
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2022-04-13     shelton      first version
 */

#ifndef __DRV_COMMON_H__
#define __DRV_COMMON_H__

#include <rtthread.h>
#include <rthw.h>
#include "at32f435_437.h"
#include "at32f435_437_conf.h"
#include "SEGGER_RTT.h"
#include "board.h"

#ifdef __cplusplus
extern "C" {
#endif

/* RTT打印组件 */
#define RTT_DBG_ENABLE          (1)
#if RTT_DBG_ENABLE
    #include "SEGGER_RTT.h"
	
	#define RTT_FINSH_ENABLE	(1)
	#if RTT_FINSH_ENABLE
	/* RTT接发缓存大小 */
	#define MAX_RTT_LENGTH  512
	#endif
	
	/* 初始化调试模式 */
    #define DEBUG_INIT()    (SEGGER_RTT_Init(),log_clear())
	
    /* RTT 终端通道 */
    #define RTT_DBG_PORT        0
	#define LOG_PROTO(type,color,format,...)                        \
			SEGGER_RTT_printf(RTT_DBG_PORT,"%s%s"format"\r\n",    	\
							color,                                  \
							type,                                   \
							##__VA_ARGS__)
							
    /* 清屏 */
    #define log_clear()     SEGGER_RTT_WriteString(RTT_DBG_PORT, "  "RTT_CTRL_CLEAR)
	
    /* 无颜色日志输出 */
    #define log_debug(format,...)   LOG_PROTO("DEBUG> ","",format,##__VA_ARGS__)
	
    /* 有颜色格式日志输出 */
    #define log_info(format,...)    LOG_PROTO("INFO> ", RTT_CTRL_TEXT_BRIGHT_GREEN , format, ##__VA_ARGS__)
    #define log_warn(format,...)    LOG_PROTO("WARN> ", RTT_CTRL_TEXT_BRIGHT_YELLOW, format, ##__VA_ARGS__)
    #define log_error(format,...)   LOG_PROTO("ERROR> ", RTT_CTRL_TEXT_BRIGHT_RED   , format, ##__VA_ARGS__)
#else
    #define DEBUG_INIT()
    #define log_clear()
    #define log_debug
    #define log_info
    #define log_warn
    #define log_error
#endif

void _Error_Handler(char *s, int num);

#ifndef Error_Handler
#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#endif

#define DMA_NOT_AVAILABLE ((DMA_INSTANCE_TYPE *)0xFFFFFFFFU)

#define __AT32_PORT(port)  GPIO##port##_BASE
#define GET_PIN(PORTx,PIN) (rt_base_t)((16 * (((rt_base_t)__AT32_PORT(PORTx) - (rt_base_t)GPIOA_BASE)/(0x0400UL) )) + PIN)

#define AT32_FLASH_START_ADRESS       ROM_START
#define AT32_FLASH_SIZE               ROM_SIZE
#define AT32_FLASH_END_ADDRESS        ROM_END

#define AT32_SRAM1_SIZE               RAM_SIZE
#define AT32_SRAM1_START              RAM_START
#define AT32_SRAM1_END                RAM_END

#if defined(__CC_ARM) || defined(__CLANG_ARM)
extern int Image$RW_IRAM1$ZI$Limit;
#define HEAP_BEGIN      ((void *)&Image$RW_IRAM1$ZI$Limit)
#elif __ICCARM__
#pragma section="CSTACK"
#define HEAP_BEGIN      (__segment_end("CSTACK"))
#else
extern int __bss_end;
#define HEAP_BEGIN      ((void *)&__bss_end)
#endif

#define HEAP_END                       AT32_SRAM1_END

#ifdef __cplusplus
}
#endif

#endif
